spec/vcr/VAT/Seller_in_EU_country_Buyer_in_another_EU_country/Seller_has_Nexus_Jurisdition_Registered/destination_country_tax_is_returned.yml

---
http_interactions:
- request:
    method: post
    uri: https://development.avalara.net/1.0/tax/get
    body:
      encoding: UTF-8
      string: '{"DocCode":"R235598649","DocDate":"2019-01-22","Discount":"0.0","Commit":false,"DocType":"SalesOrder","Addresses":[{"AddressCode":"Orig","Line1":"34
        Borgo degli Albizi","Line2":"","City":"Florence","Region":"","PostalCode":"50122","Country":"IT"},{"AddressCode":"Dest","Line1":"89
        Nieuwendijk","Line2":"","City":"Amsterdam","Region":"","Country":"NL","PostalCode":"1012
        MC"},{"AddressCode":"1","Line1":"34 Borgo degli Albizi","Line2":null,"City":"Florence","PostalCode":"20500","Country":"IT"}],"Lines":[{"LineNo":"1-LI","Description":"Product
        #9 - 8182","TaxCode":"PC030000","ItemCode":"SKU-9","Qty":1,"Amount":19.99,"OriginCode":"1","DestinationCode":"Dest","CustomerUsageType":null,"Discounted":false,"TaxIncluded":true},{"LineNo":"1-FR","ItemCode":"Avalara
        Ground","Qty":1,"Amount":10.0,"OriginCode":"1","DestinationCode":"Dest","CustomerUsageType":null,"Description":"Shipping
        Charge","TaxCode":"FR000000","Discounted":false,"TaxIncluded":true}],"CustomerCode":1,"CompanyCode":"54321","CustomerUsageType":null,"ExemptionNo":null,"Client":"a0o33000004FH8l","ReferenceCode":"R235598649","DetailLevel":"Tax","CurrencyCode":"USD"}'
    headers:
      Accept:
      - "*/*"
      Accept-Encoding:
      - gzip, deflate
      User-Agent:
      - rest-client/2.0.2 (darwin16.7.0 x86_64) ruby/2.5.1p57
      Authorization:
      - Basic MTEwMDExMzA5NjoxRDEzRURBMkRDQ0M3RTRB
      Content-Type:
      - application/json
      Content-Length:
      - '1131'
      Host:
      - development.avalara.net
  response:
    status:
      code: 200
      message: OK
    headers:
      Date:
      - Mon, 21 Jan 2019 21:44:32 GMT
      Content-Type:
      - text/json; charset=utf-8
      Content-Length:
      - '695'
      Connection:
      - keep-alive
      Cache-Control:
      - private
      Content-Encoding:
      - gzip
      Vary:
      - Accept-Encoding
      Server:
      - Microsoft-IIS/8.5
      X-Aspnet-Version:
      - 4.0.30319
      X-Powered-By:
      - ASP.NET
    body:
      encoding: ASCII-8BIT
      string: !binary |-
        H4sIAAAAAAAEAO29B2AcSZYlJi9tynt/SvVK1+B0oQiAYBMk2JBAEOzBiM3mkuwdaUcjKasqgcplVmVdZhZAzO2dvPfee++999577733ujudTif33/8/XGZkAWz2zkrayZ4hgKrIHz9+fB8/In5x8tHTanpSzfKPHqUfvdq7d//+w4NP9x9+NOIvnmYtf7G3s/twe2d3e28PX7wpFnnTZotV8NXum73dR/v7j+7tjB9+enDwYP+nuG3VZuXxolovW269P35wYD9/WjRT882O/fT0Xb5YtUW1DD9+k73LJqWgE0ChL/Dh/fHerv/ZSVZO1yUNYBZ8m70bGFT27nmxzBv65nsJkQV/vKjor492t5+faQtDqJcnO/d26NGPs0lRFu01vmnrdY5Pn9C4Zll9/Ty/zEt88VPF6j6+4OYyjN1Px/e571eK0Q4hSVANWHx0b7z/AH/2SUXYBCM0LSPkozHnbVaUdnD0yddB4lV+oXBfPMffJ8Co5nHLB99Z10Xz5nrFgMy35vMX2YI/f3H65tunr54fv3j62n5nCCtgqFvT+HWbgY6zlNH7Jcn3k1+SjGgE/vQ8e6UvGSjPXhH+9OjH7zM9ferFKG+IdzDe+xQfMXL0d4R2u+MH+/pnOF/eF53ZMYSjRkKPLt2ZZENkNkSQpgT9ayDLgMwUdOaLmppvYpPz/UTaHM9mdd40TqD0A/rzo4OH6YsiX1/ly1nx028BVL80uD8l/YKPT3TajhdNm9ezbMEf6oDpcxnjy4q0UWne3d3Z3Uu/OMEXhIaQ7owpvrdzf+chqzYen3mBgAhPKRL47N5++qSqL6p0ll+URXpcToofFHhT25h3WacYLJ+VVZ0vp8xgHpJnb/BBiCRQMYTvochfBCgSCKXsq7xZl635/PV6OiVsPvolyf8D4uKRTMkFAAA=
    http_version: 
  recorded_at: Mon, 21 Jan 2019 21:44:29 GMT
- request:
    method: post
    uri: https://development.avalara.net/1.0/tax/get
    body:
      encoding: UTF-8
      string: '{"DocCode":"R235598649","DocDate":"2019-01-22","Discount":"0.0","Commit":false,"DocType":"SalesOrder","Addresses":[{"AddressCode":"Orig","Line1":"34
        Borgo degli Albizi","Line2":"","City":"Florence","Region":"","PostalCode":"50122","Country":"IT"},{"AddressCode":"Dest","Line1":"89
        Nieuwendijk","Line2":"","City":"Amsterdam","Region":"","Country":"NL","PostalCode":"1012
        MC"},{"AddressCode":"1","Line1":"34 Borgo degli Albizi","Line2":null,"City":"Florence","PostalCode":"20500","Country":"IT"}],"Lines":[{"LineNo":"1-LI","Description":"Product
        #9 - 8182","TaxCode":"PC030000","ItemCode":"SKU-9","Qty":1,"Amount":19.99,"OriginCode":"1","DestinationCode":"Dest","CustomerUsageType":null,"Discounted":false,"TaxIncluded":true},{"LineNo":"1-FR","ItemCode":"Avalara
        Ground","Qty":1,"Amount":10.0,"OriginCode":"1","DestinationCode":"Dest","CustomerUsageType":null,"Description":"Shipping
        Charge","TaxCode":"FR000000","Discounted":false,"TaxIncluded":true}],"CustomerCode":1,"CompanyCode":"54321","CustomerUsageType":null,"ExemptionNo":null,"Client":"a0o33000004FH8l","ReferenceCode":"R235598649","DetailLevel":"Tax","CurrencyCode":"USD"}'
    headers:
      Accept:
      - "*/*"
      Accept-Encoding:
      - gzip, deflate
      User-Agent:
      - rest-client/2.0.2 (darwin16.7.0 x86_64) ruby/2.5.1p57
      Authorization:
      - Basic MTEwMDExMzA5NjoxRDEzRURBMkRDQ0M3RTRB
      Content-Type:
      - application/json
      Content-Length:
      - '1131'
      Host:
      - development.avalara.net
  response:
    status:
      code: 200
      message: OK
    headers:
      Date:
      - Mon, 21 Jan 2019 21:44:34 GMT
      Content-Type:
      - text/json; charset=utf-8
      Content-Length:
      - '696'
      Connection:
      - keep-alive
      Cache-Control:
      - private
      Content-Encoding:
      - gzip
      Vary:
      - Accept-Encoding
      Server:
      - Microsoft-IIS/8.5
      X-Aspnet-Version:
      - 4.0.30319
      X-Powered-By:
      - ASP.NET
    body:
      encoding: ASCII-8BIT
      string: !binary |-
        H4sIAAAAAAAEAO29B2AcSZYlJi9tynt/SvVK1+B0oQiAYBMk2JBAEOzBiM3mkuwdaUcjKasqgcplVmVdZhZAzO2dvPfee++999577733ujudTif33/8/XGZkAWz2zkrayZ4hgKrIHz9+fB8/In5x8tHTanpSzfKPHqUfvdq7d//+w4NP9x9+NOIvnmYtf7G3s/twe2d3e28PX7wpFnnTZotV8NXum73dR/v7j+7dHz/YOTg42Nv7KW5ctVl5vKjWy5ab748fHNjPnxbN1HyzYz89fZcvVm1RLcOP32Tvskkp+ARQ6At8eH+8t+t/dpKV03VJI5gF32bvBkaVvXteLPOGvvleQnTBHy8q+uuj3e3nZ9rCUOrlyc69HXr042xSlEV7jW/aep3j0yc0rllWXz/PL/MSX/xUsbqPL7i5DGP30/F97vuVYrRDSBJUAxYf3RvvP8CffVIRNsEITcsI+WjMeZsVpR0cffJ1kHiVXyjcF8/x9wkwqnnc8sF31nXRvLleMSDzrfn8Rbbgz1+cvvn26avnxy+evrbfGcIKGOrWNH7dZqDjLGX0fkny/eSXJCMagT89z17pSwbKs1eEPz368ftMT596Mcob4h2M9z7FR4wc/R2h3e74wb7+Gc6X90VndgzhqJHQo0t3JtkQmQ0RpClB/xrIMiAzBZ35oqbmm9jkfD+RNsezWZ03jRMo/YD+/OjgYfqiyNdX+XJW/PRbANUvDe5PScHg4xOdtuNF0+b1LFvwhzpg+lzG+LIidVSad3d3dvfSL07wBaEhpDtjiu/t3N95yLqNx2deICDCU4oEPru3nz6p6osqneUXZZEel5PiBwXe1DbmXdYpBstnZVXnyykzmIfk2Rt8ECIJVAzheyjyFwGKBEIp+ypv1mVrPn+9nk4Jm49+SfL/AB58jfrKBQAA
    http_version: 
  recorded_at: Mon, 21 Jan 2019 21:44:31 GMT
recorded_with: VCR 4.0.0
