spec/vcr/VAT/Seller_in_EU_country_Buyer_in_another_EU_country/Seller_does_not_have_Nexus_Jurisdition_Registered/TotalTax_is_equal_to_order_included_tax_total.yml

---
http_interactions:
- request:
    method: post
    uri: https://development.avalara.net/1.0/tax/get
    body:
      encoding: UTF-8
      string: '{"DocCode":"R133526798","DocDate":"2017-08-02","Discount":"0.0","Commit":false,"DocType":"SalesOrder","Addresses":[{"AddressCode":"Orig","Line1":"34
        Borgo degli Albizi","Line2":"","City":"Florence","Region":"","PostalCode":"50122","Country":"IT"},{"AddressCode":"Dest","Line1":"8
        Boulevard du Palais","Line2":"","City":"Paris","Region":"","Country":"FR","PostalCode":"75001"},{"AddressCode":"1","Line1":"34
        Borgo degli Albizi","Line2":null,"City":"Florence","PostalCode":"20500","Country":"IT"}],"Lines":[{"LineNo":"1-LI","Description":"Product
        #23 - 6536","TaxCode":"PC030000","ItemCode":"SKU-23","Qty":1,"Amount":19.99,"OriginCode":"1","DestinationCode":"Dest","CustomerUsageType":null,"Discounted":false,"TaxIncluded":true},{"LineNo":"2-FR","ItemCode":"Avalara
        Ground","Qty":1,"Amount":10.0,"OriginCode":"1","DestinationCode":"Dest","CustomerUsageType":null,"Description":"Shipping
        Charge","TaxCode":"FR000000","Discounted":false,"TaxIncluded":true}],"CustomerCode":1,"CompanyCode":"54321","CustomerUsageType":null,"ExemptionNo":null,"Client":"a0o33000004FH8l","ReferenceCode":"R133526798","DetailLevel":"Tax","CurrencyCode":"USD"}'
    headers:
      Accept:
      - "*/*; q=0.5, application/xml"
      Accept-Encoding:
      - gzip, deflate
      Authorization:
      - Basic MTEwMDExMzA5NjoxRDEzRURBMkRDQ0M3RTRB
      Content-Type:
      - application/json
      Content-Length:
      - '1134'
      User-Agent:
      - Ruby
  response:
    status:
      code: 200
      message: OK
    headers:
      Cache-Control:
      - private
      Content-Type:
      - text/json; charset=utf-8
      Content-Encoding:
      - gzip
      Vary:
      - Accept-Encoding
      X-Aspnet-Version:
      - 4.0.30319
      X-Powered-By:
      - ASP.NET
      Date:
      - Wed, 02 Aug 2017 23:36:32 GMT
      Content-Length:
      - '679'
      Set-Cookie:
      - TS017f1821=01a8ddc44e47b18124f6eeef010fb3eebe6ad27909d13f0132cfda111006c03b226b11b732afae6596c65b05dafa2737ad49ae6e08;
        Path=/
    body:
      encoding: ASCII-8BIT
      string: !binary |-
        H4sIAAAAAAAEAO29B2AcSZYlJi9tynt/SvVK1+B0oQiAYBMk2JBAEOzBiM3m
        kuwdaUcjKasqgcplVmVdZhZAzO2dvPfee++999577733ujudTif33/8/XGZk
        AWz2zkrayZ4hgKrIHz9+fB8/In5x8tHTanpSzfKPHqUfvdq9d+/+3qcPHh58
        NOIvnmYtf7G3s/tge+dge2cPX7wpFnnTZotV+NWbvXuP7n366N7eeB/P/U9/
        ihtXbVYeL6r1suXm++P7D+3nT4tmar7ZsZ+evssXq7aoluHHb7J32aQUfAIo
        9AU+vD/e9z86ycrpuqQBzPwvs3cDY8rePS+WeUPffC8hquCPFxX99dHu9vMz
        bWHo9PJk594OPfpxNinKor3GN229zvHpExrVLKuvn+eXeYkvfqpY3ccX3FwG
        sfvp+B4P4pVitDPe2yOoBiw+ujf+FH/16UTIBOPThhHS0YjzNitKOzT65Gug
        8Cq/ULBnb/D3CfCpedDywXfWddG8uV4xHPOt+fxFtuDPz94cP/997KeGngKA
        +jPNXrcZyDdLGa9fknw/+SXJiFB3s7K3/eyVvmSgPHtFiNOjH7/PrPTJFqO4
        odrBmFmGcaM/IzTbHbME0V/hLLnPO3Ni6EVthBhdcjO9hqhrKCBNCfp7Y8pg
        DPXtJFEb81lsRr6fSJvj2azOm8YJj35Af350kBLRy/wSr87W6cuszIoGsLWN
        Qf0paRR8fKJT9jIjhPgDHSt9JjP+siLdU5r3Htzf2dnFx4SH0OyMKb23c3/n
        gEWeh2aaEwjhJO0en93bJxzriyqd5RdlkR6Xk+IHBd7UNuZd7sbg96ys6nw5
        ZbbyUJQZCFEEKobkXRQf8hcBigRCSfsqb9Zlaz5/vZ5OCZuPfkny/wBMQPyr
        tQUAAA==
    http_version: 
  recorded_at: Wed, 02 Aug 2017 23:36:32 GMT
- request:
    method: post
    uri: https://development.avalara.net/1.0/tax/get
    body:
      encoding: UTF-8
      string: '{"DocCode":"R133526798","DocDate":"2017-08-02","Discount":"0.0","Commit":false,"DocType":"SalesOrder","Addresses":[{"AddressCode":"Orig","Line1":"34
        Borgo degli Albizi","Line2":"","City":"Florence","Region":"","PostalCode":"50122","Country":"IT"},{"AddressCode":"Dest","Line1":"8
        Boulevard du Palais","Line2":"","City":"Paris","Region":"","Country":"FR","PostalCode":"75001"},{"AddressCode":"1","Line1":"34
        Borgo degli Albizi","Line2":null,"City":"Florence","PostalCode":"20500","Country":"IT"}],"Lines":[{"LineNo":"1-LI","Description":"Product
        #23 - 6536","TaxCode":"PC030000","ItemCode":"SKU-23","Qty":1,"Amount":19.99,"OriginCode":"1","DestinationCode":"Dest","CustomerUsageType":null,"Discounted":false,"TaxIncluded":true},{"LineNo":"2-FR","ItemCode":"Avalara
        Ground","Qty":1,"Amount":10.0,"OriginCode":"1","DestinationCode":"Dest","CustomerUsageType":null,"Description":"Shipping
        Charge","TaxCode":"FR000000","Discounted":false,"TaxIncluded":true}],"CustomerCode":1,"CompanyCode":"54321","CustomerUsageType":null,"ExemptionNo":null,"Client":"a0o33000004FH8l","ReferenceCode":"R133526798","DetailLevel":"Tax","CurrencyCode":"USD"}'
    headers:
      Accept:
      - "*/*; q=0.5, application/xml"
      Accept-Encoding:
      - gzip, deflate
      Authorization:
      - Basic MTEwMDExMzA5NjoxRDEzRURBMkRDQ0M3RTRB
      Content-Type:
      - application/json
      Content-Length:
      - '1134'
      User-Agent:
      - Ruby
  response:
    status:
      code: 200
      message: OK
    headers:
      Cache-Control:
      - private
      Content-Type:
      - text/json; charset=utf-8
      Content-Encoding:
      - gzip
      Vary:
      - Accept-Encoding
      X-Aspnet-Version:
      - 4.0.30319
      X-Powered-By:
      - ASP.NET
      Date:
      - Wed, 02 Aug 2017 23:36:32 GMT
      Content-Length:
      - '654'
      Set-Cookie:
      - TS017f1821=01a8ddc44e7aa3e5b6a7bcf91f35693587e00b919a189b3af3c2d83095e2269af009d92852adfc879aebbeccfede1f5f121f566b43;
        Path=/
    body:
      encoding: ASCII-8BIT
      string: !binary |-
        H4sIAAAAAAAEAO29B2AcSZYlJi9tynt/SvVK1+B0oQiAYBMk2JBAEOzBiM3m
        kuwdaUcjKasqgcplVmVdZhZAzO2dvPfee++999577733ujudTif33/8/XGZk
        AWz2zkrayZ4hgKrIHz9+fB8/In5x8tGrvFmX7Uk1yz96lH70ej2d5k3z0Sj5
        6Gk1NZ++2r137/7epw8eHugXT7OWv9jb2X2wvXOwvbOHL94Ui7xps8Uq/OrN
        3r1H9z59dO/eeOfBg51PP93/KW5ctVl5vKjWy5ab74/vP7SfPy2aqflmx356
        +i5frNqiWoYfv8neZZNS8Amg0Bf48P543//oJCun65IGMPO/zN49L5Z5Qx99
        LyGq4I8XFf310e728zNtYcjx8mTn3g49+nE2KcqivcY3bb3O8ekTQn6W1dfP
        88u8xBc/Vazu44v+EPpDBUQZzu6n43s8nFeELj7YGe/tUcemHT66N/5U/woH
        5j5/mrdZUdqhnaC3mtE9e4Mmr/ILRUj+/s66Lpo31yvu0bQ2nxsaSFOC/jVw
        ZUAvsgU3O3tz/Pz3wafUxnz2us1AvlnKsH5J8v3klyQjQt3Nyt72s1f6ksHo
        2SvqjB79+GdvVg7GzO2MG/0ZGefumAWF/grnxH3+w5mTW2PKYAz1bzsj30+k
        zfFsVpPOcMKjH9CfHx2kRPQyv8Srs3X6MiuzgrWLtjGoPyXFgY9PdMpeZoQQ
        f6Bjpc9kxl9WpGJK896D+zs7u/iY8BCanTGl93bu7xywZPPQTHMCIZyk3eOz
        e/uEY31RpbP8oizS43JS/KDAm9rGvMvdGPyelVWdL6fMVh6KMgMhikDFkLyL
        4kP+IkCRQDjSRvTsL0n+H1NB8QO1BQAA
    http_version: 
  recorded_at: Wed, 02 Aug 2017 23:36:33 GMT
recorded_with: VCR 3.0.3
