spec/vcr/VAT/Seller_in_EU_country_Buyer_in_another_EU_country/Seller_has_Nexus_Jurisdition_Registered/TotalTax_is_equal_to_order_included_tax_total.yml

---
http_interactions:
- request:
    method: post
    uri: https://development.avalara.net/1.0/tax/get
    body:
      encoding: UTF-8
      string: '{"DocCode":"R038761798","DocDate":"2017-08-02","Discount":"0.0","Commit":false,"DocType":"SalesOrder","Addresses":[{"AddressCode":"Orig","Line1":"34
        Borgo degli Albizi","Line2":"","City":"Florence","Region":"","PostalCode":"50122","Country":"IT"},{"AddressCode":"Dest","Line1":"89
        Nieuwendijk","Line2":"","City":"Amsterdam","Region":"","Country":"NL","PostalCode":"1012
        MC"},{"AddressCode":"1","Line1":"34 Borgo degli Albizi","Line2":null,"City":"Florence","PostalCode":"20500","Country":"IT"}],"Lines":[{"LineNo":"1-LI","Description":"Product
        #20 - 897","TaxCode":"PC030000","ItemCode":"SKU-20","Qty":1,"Amount":19.99,"OriginCode":"1","DestinationCode":"Dest","CustomerUsageType":null,"Discounted":false,"TaxIncluded":true},{"LineNo":"2-FR","ItemCode":"Avalara
        Ground","Qty":1,"Amount":10.0,"OriginCode":"1","DestinationCode":"Dest","CustomerUsageType":null,"Description":"Shipping
        Charge","TaxCode":"FR000000","Discounted":false,"TaxIncluded":true}],"CustomerCode":1,"CompanyCode":"54321","CustomerUsageType":null,"ExemptionNo":null,"Client":"a0o33000004FH8l","ReferenceCode":"R038761798","DetailLevel":"Tax","CurrencyCode":"USD"}'
    headers:
      Accept:
      - "*/*; q=0.5, application/xml"
      Accept-Encoding:
      - gzip, deflate
      Authorization:
      - Basic MTEwMDExMzA5NjoxRDEzRURBMkRDQ0M3RTRB
      Content-Type:
      - application/json
      Content-Length:
      - '1132'
      User-Agent:
      - Ruby
  response:
    status:
      code: 200
      message: OK
    headers:
      Cache-Control:
      - private
      Content-Type:
      - text/json; charset=utf-8
      Content-Encoding:
      - gzip
      Vary:
      - Accept-Encoding
      X-Aspnet-Version:
      - 4.0.30319
      X-Powered-By:
      - ASP.NET
      Date:
      - Wed, 02 Aug 2017 23:36:26 GMT
      Content-Length:
      - '671'
      Set-Cookie:
      - TS017f1821=01a8ddc44ed78f879084ff78c09db9f5cad524759dfaf128fcf34dd1f19e1ffd766b0b169cbdd0d77ea604f2a10269440c07f55390;
        Path=/
    body:
      encoding: ASCII-8BIT
      string: !binary |-
        H4sIAAAAAAAEAO29B2AcSZYlJi9tynt/SvVK1+B0oQiAYBMk2JBAEOzBiM3m
        kuwdaUcjKasqgcplVmVdZhZAzO2dvPfee++999577733ujudTif33/8/XGZk
        AWz2zkrayZ4hgKrIHz9+fB8/In5x8tGrvFmX7Uk1yz96lH70ej2d5k3z0Sj5
        6Gk1NZ++2rl38ODT3QcPD/SLp1nLX+zt7D7Y3jnY3tnDF2+KRd602WIVfvVm
        796je58+2vt0/HDvwc7Owd5PceOqzcrjRbVettx8f/yAofPnT4tmar7ZsZ+e
        vssXq7aoluHHb7J32aQUfAIo9AU+vD/e2/U/O8nK6bqkEcyCb7N3z4tl3tBn
        30uILvjjRUV/fbS7/fxMWxiCvDzZubdDj36cTYqyaK/xTVuvc3z6hNCfZfX1
        8/wyL/HFTxWr+/iiP4j+YAFRBrT76fg+0/YV4YsPdghd6ti0w0f3xvsP9M9w
        aN4XT/M2K0o7uBP0VzPCL56jyav8QlGSv7+zrovmzfWK+zStzeeGCtKUoH8d
        bBnSi2zB7V6cvvn26avnxy+evsZ31NR887rNQMdZyiB/SfL95JckIxqBm569
        7Wev9CWD2LNX1Cc9+vHP3vQcjPc+xUeMHP0dGe/u+MG+/hnOjvfFD2d23gNZ
        BmSm4P0m5/uJtDmezWrSJE6g9AP686ODh+mLIl9f5ctZ8dNvAVS/NLg/JT2C
        j0902o4XTZvXs2zBH+qA6XMZ48uKtE5p3t3d2d1LvzjBF4SGkO6MKb63c3/n
        4UN8weMzLxAQ4SlFAp/d20+fVPVFlc7yi7JIj8tJ8YMCb2ob8y6rDoPls7Kq
        8+WUGcxD8uwNPgiRBCqG8D0U+YsARQLhKBtRvr8k+X8A93/XGcoFAAA=
    http_version: 
  recorded_at: Wed, 02 Aug 2017 23:36:27 GMT
- request:
    method: post
    uri: https://development.avalara.net/1.0/tax/get
    body:
      encoding: UTF-8
      string: '{"DocCode":"R038761798","DocDate":"2017-08-02","Discount":"0.0","Commit":false,"DocType":"SalesOrder","Addresses":[{"AddressCode":"Orig","Line1":"34
        Borgo degli Albizi","Line2":"","City":"Florence","Region":"","PostalCode":"50122","Country":"IT"},{"AddressCode":"Dest","Line1":"89
        Nieuwendijk","Line2":"","City":"Amsterdam","Region":"","Country":"NL","PostalCode":"1012
        MC"},{"AddressCode":"1","Line1":"34 Borgo degli Albizi","Line2":null,"City":"Florence","PostalCode":"20500","Country":"IT"}],"Lines":[{"LineNo":"1-LI","Description":"Product
        #20 - 897","TaxCode":"PC030000","ItemCode":"SKU-20","Qty":1,"Amount":19.99,"OriginCode":"1","DestinationCode":"Dest","CustomerUsageType":null,"Discounted":false,"TaxIncluded":true},{"LineNo":"2-FR","ItemCode":"Avalara
        Ground","Qty":1,"Amount":10.0,"OriginCode":"1","DestinationCode":"Dest","CustomerUsageType":null,"Description":"Shipping
        Charge","TaxCode":"FR000000","Discounted":false,"TaxIncluded":true}],"CustomerCode":1,"CompanyCode":"54321","CustomerUsageType":null,"ExemptionNo":null,"Client":"a0o33000004FH8l","ReferenceCode":"R038761798","DetailLevel":"Tax","CurrencyCode":"USD"}'
    headers:
      Accept:
      - "*/*; q=0.5, application/xml"
      Accept-Encoding:
      - gzip, deflate
      Authorization:
      - Basic MTEwMDExMzA5NjoxRDEzRURBMkRDQ0M3RTRB
      Content-Type:
      - application/json
      Content-Length:
      - '1132'
      User-Agent:
      - Ruby
  response:
    status:
      code: 200
      message: OK
    headers:
      Cache-Control:
      - private
      Content-Type:
      - text/json; charset=utf-8
      Content-Encoding:
      - gzip
      Vary:
      - Accept-Encoding
      X-Aspnet-Version:
      - 4.0.30319
      X-Powered-By:
      - ASP.NET
      Date:
      - Wed, 02 Aug 2017 23:36:26 GMT
      Content-Length:
      - '671'
      Set-Cookie:
      - TS017f1821=01a8ddc44e98a48e57709e3df08247928a79412d4d453abf9967c04b24065d118827d8da3eef7d9dbe838fac48b784984bcd700d91;
        Path=/
    body:
      encoding: ASCII-8BIT
      string: !binary |-
        H4sIAAAAAAAEAO29B2AcSZYlJi9tynt/SvVK1+B0oQiAYBMk2JBAEOzBiM3m
        kuwdaUcjKasqgcplVmVdZhZAzO2dvPfee++999577733ujudTif33/8/XGZk
        AWz2zkrayZ4hgKrIHz9+fB8/In5x8tGrvFmX7Uk1yz96lH70ej2d5k3z0Sj5
        6Gk1NZ++2rl38ODT3QcPD/SLp1nLX+zt7D7Y3jnY3tnDF2+KRd602WIVfvVm
        796je58+2nswvr/7YHf3072f4sZVm5XHi2q9bLn5/vgBQ+fPnxbN1HyzYz89
        fZcvVm1RLcOP32Tvskkp+ARQ6At8eH+8t+t/dpKV03VJI5gF32bvnhfLvKHP
        vpcQXfDHi4r++mh3+/mZtjAEeXmyc2+HHv04mxRl0V7jm7Ze5/j0CaE/y+rr
        5/llXuKLnypW9/FFfxD9wQKiDGj30/F9pu0rwhcf7BC61LFph4/ujfcf6J/h
        0LwvnuZtVpR2cCfor2aEXzxHk1f5haIkf39nXRfNm+sV92lam88NFaQpQf86
        2DKkF9mC2704ffPt01fPj188fY3vqKn55nWbgY6zlEH+kuT7yS9JRjQCNz17
        289e6UsGsWevqE969OOfvek5GO99io8YOfo7Mt7d8YN9/TOcHe+LH87svAey
        DMhMwftNzvcTaXM8m9WkSZxA6Qf050cHD9MXRb6+ypez4qffAqh+aXB/SnoE
        H5/otB0vmjavZ9mCP9QB0+cyxpcVaZ3SvLu7s7uXfnGCLwgNId0ZU3xv5/7O
        w4f4gsdnXiAgwlOKBD67t58+qeqLKp3lF2WRHpeT4gcF3tQ25l1WHQbLZ2VV
        58spM5iH5NkbfBAiCVQM4Xso8hcBigTCUTaifH9J8v8Ad+GugsoFAAA=
    http_version: 
  recorded_at: Wed, 02 Aug 2017 23:36:27 GMT
recorded_with: VCR 3.0.3
