spec/vcr/VAT/Seller_in_EU_country_Buyer_in_same_EU_country/tax_detail_country_equals_to_IT.yml

---
http_interactions:
- request:
    method: post
    uri: https://development.avalara.net/1.0/tax/get
    body:
      encoding: UTF-8
      string: '{"DocCode":"R841844564","DocDate":"2017-08-02","Discount":"0.0","Commit":false,"DocType":"SalesOrder","Addresses":[{"AddressCode":"Orig","Line1":"34
        Borgo degli Albizi","Line2":"","City":"Florence","Region":"","PostalCode":"50122","Country":"IT"},{"AddressCode":"Dest","Line1":"34
        Borgo degli Albizi","Line2":"","City":"Florence","Region":"","Country":"IT","PostalCode":"50122"},{"AddressCode":"1","Line1":"34
        Borgo degli Albizi","Line2":null,"City":"Florence","PostalCode":"20500","Country":"IT"}],"Lines":[{"LineNo":"1-LI","Description":"Product
        #12 - 3729","TaxCode":"PC030000","ItemCode":"SKU-12","Qty":1,"Amount":19.99,"OriginCode":"1","DestinationCode":"Dest","CustomerUsageType":null,"Discounted":false,"TaxIncluded":true},{"LineNo":"2-FR","ItemCode":"Avalara
        Ground","Qty":1,"Amount":10.0,"OriginCode":"1","DestinationCode":"Dest","CustomerUsageType":null,"Description":"Shipping
        Charge","TaxCode":"FR000000","Discounted":false,"TaxIncluded":true}],"CustomerCode":1,"CompanyCode":"54321","CustomerUsageType":null,"ExemptionNo":null,"Client":"a0o33000004FH8l","ReferenceCode":"R841844564","DetailLevel":"Tax","CurrencyCode":"USD"}'
    headers:
      Accept:
      - "*/*; q=0.5, application/xml"
      Accept-Encoding:
      - gzip, deflate
      Authorization:
      - Basic MTEwMDExMzA5NjoxRDEzRURBMkRDQ0M3RTRB
      Content-Type:
      - application/json
      Content-Length:
      - '1137'
      User-Agent:
      - Ruby
  response:
    status:
      code: 200
      message: OK
    headers:
      Cache-Control:
      - private
      Content-Type:
      - text/json; charset=utf-8
      Content-Encoding:
      - gzip
      Vary:
      - Accept-Encoding
      X-Aspnet-Version:
      - 4.0.30319
      X-Powered-By:
      - ASP.NET
      Date:
      - Wed, 02 Aug 2017 23:36:11 GMT
      Content-Length:
      - '648'
      Set-Cookie:
      - TS017f1821=01a8ddc44e695c8f8cc786da503c651b678c8a508f545dcf72565fd47951a7fdfb4319d60b95c8fd385b8660dcf4887b49717297d3;
        Path=/
    body:
      encoding: ASCII-8BIT
      string: !binary |-
        H4sIAAAAAAAEAO29B2AcSZYlJi9tynt/SvVK1+B0oQiAYBMk2JBAEOzBiM3m
        kuwdaUcjKasqgcplVmVdZhZAzO2dvPfee++999577733ujudTif33/8/XGZk
        AWz2zkrayZ4hgKrIHz9+fB8/In5x8tHTanpSzfKPHqUfvTrY3z3Y37//6f5H
        I/7iadbyF3s7uw+2dw62d/bwxZtikTdttliFX73Zu/fo3qePdvfGu/v3H3x6
        f++nuHHVZuXxolovW26+P77/0H7+tGim5psd++npu3yxaotqGX78JnuXTUrB
        J4BCX+DD+2NG23x0kpXTdUkDmPlfZu8GxpS9e14s84a++V5CVMEfLyr666Pd
        7edn2sLQ6eXJzr0devTjbFKURXuNb9p6nePTJzSqWVZfP88v8xJf/FSxuo8v
        uLkMYvfT8T0exCvFaGe8t0dQDVh8dG/8Kf7q04mQCcanDSOkoxHnbVaUdmj0
        yddA4VV+oWDP3uDvE+BT86Dlg++s66J5c71iOOZb8/mLbMGfn705fv772E8N
        PQUA9WeavW4zkG+WMl6/JPl+8kuSEaHuZmVv+9krfclAefaKEKdHP36fWemT
        LUZxQ7WDMbMM40Z/Rmi2Oz7Qv8JZcp935sTQi9oIMbrkZnoNUddQQJoS9PfG
        lMEY6ttJojbms9iMfD+RNsezWZ03jRMe/YD+/Ojefvqkqi+qdJZflEV6XE6K
        HxSArW0M6k9Jo+DjE52yZ2VV58spT5sZLn0sI3xZkfopzav3d3b3eJiEipDt
        jIm9t3N/5yGPlUdnmhMIYSbFAJ/dFstdfPY1UAQqjMl7oMjUfZU367I1n79e
        T6eEzUe/JPl/AIKlDo64BQAA
    http_version: 
  recorded_at: Wed, 02 Aug 2017 23:36:12 GMT
- request:
    method: post
    uri: https://development.avalara.net/1.0/tax/get
    body:
      encoding: UTF-8
      string: '{"DocCode":"R841844564","DocDate":"2017-08-02","Discount":"0.0","Commit":false,"DocType":"SalesOrder","Addresses":[{"AddressCode":"Orig","Line1":"34
        Borgo degli Albizi","Line2":"","City":"Florence","Region":"","PostalCode":"50122","Country":"IT"},{"AddressCode":"Dest","Line1":"34
        Borgo degli Albizi","Line2":"","City":"Florence","Region":"","Country":"IT","PostalCode":"50122"},{"AddressCode":"1","Line1":"34
        Borgo degli Albizi","Line2":null,"City":"Florence","PostalCode":"20500","Country":"IT"}],"Lines":[{"LineNo":"1-LI","Description":"Product
        #12 - 3729","TaxCode":"PC030000","ItemCode":"SKU-12","Qty":1,"Amount":19.99,"OriginCode":"1","DestinationCode":"Dest","CustomerUsageType":null,"Discounted":false,"TaxIncluded":true},{"LineNo":"2-FR","ItemCode":"Avalara
        Ground","Qty":1,"Amount":10.0,"OriginCode":"1","DestinationCode":"Dest","CustomerUsageType":null,"Description":"Shipping
        Charge","TaxCode":"FR000000","Discounted":false,"TaxIncluded":true}],"CustomerCode":1,"CompanyCode":"54321","CustomerUsageType":null,"ExemptionNo":null,"Client":"a0o33000004FH8l","ReferenceCode":"R841844564","DetailLevel":"Tax","CurrencyCode":"USD"}'
    headers:
      Accept:
      - "*/*; q=0.5, application/xml"
      Accept-Encoding:
      - gzip, deflate
      Authorization:
      - Basic MTEwMDExMzA5NjoxRDEzRURBMkRDQ0M3RTRB
      Content-Type:
      - application/json
      Content-Length:
      - '1137'
      User-Agent:
      - Ruby
  response:
    status:
      code: 200
      message: OK
    headers:
      Cache-Control:
      - private
      Content-Type:
      - text/json; charset=utf-8
      Content-Encoding:
      - gzip
      Vary:
      - Accept-Encoding
      X-Aspnet-Version:
      - 4.0.30319
      X-Powered-By:
      - ASP.NET
      Date:
      - Wed, 02 Aug 2017 23:36:11 GMT
      Content-Length:
      - '620'
      Set-Cookie:
      - TS017f1821=01a8ddc44e74e7715d8b906df2f8565bf8879ffdff181f7ef0decd61a735272bcf85def516748c4ea1c059f30ddb4ca136c520f23b;
        Path=/
    body:
      encoding: ASCII-8BIT
      string: !binary |-
        H4sIAAAAAAAEAO29B2AcSZYlJi9tynt/SvVK1+B0oQiAYBMk2JBAEOzBiM3m
        kuwdaUcjKasqgcplVmVdZhZAzO2dvPfee++999577733ujudTif33/8/XGZk
        AWz2zkrayZ4hgKrIHz9+fB8/In5x8tGrvFmX7Uk1yz96lH70ej2d5k3z0Sj5
        6Gk1NZ++OtjfPdjfv//pvn7xNGv5i72d3QfbOwfbO3v44k2xyJs2W6zCr97s
        3Xt079NHu3vjg/1PHzzcf/BT3Lhqs/J4Ua2XLTffH99/aD9/WjRT882O/fT0
        Xb5YtUW1DD9+k73LJqXgE0ChL/Dh/TGjbT46ycrpuqQBzPwvs3fPi2Xe0Eff
        S4gq+ONFRX99tLv9/ExbGHK8PNm5t0OPfpxNirJor/FNW69zfPqEkJ9l9fXz
        /DIv8cVPFav7+KI/hP5QAVGGs/vp+B4P5xWhiw92xnt71LFph4/ujT/Vv8KB
        uc+f5m1WlHZoJ+itZnTP3qDJq/xCEZK/v7Oui+bN9Yp7NK3N54YG0pSgfw1c
        GdCLbMHNzt4cP/998Cm1MZ+9bjOQb5YyrF+SfD/5JcmIUHezsrf97JW+ZDB6
        9oo6o0c//tmblYMxczvjRn9Gxrk7PtC/wjlxn/9w5uTWmDIYQ/3bzsj3E2lz
        PJvVpDOc8OgH9OdH9/bTJ1V9UaWz/KIs0uNyUvygAGxtY1B/SooDH5/olD0r
        qzpfTnnazHDpYxnhy4q0TGlevb+zu8fDJFSEbGdM7L2d+zsPeaw8OtOcQAgz
        KQb47LZY7uKzr4EiUGFM3gNFQ92Iqv0lyf8D/ErYGrgFAAA=
    http_version: 
  recorded_at: Wed, 02 Aug 2017 23:36:13 GMT
recorded_with: VCR 3.0.3
