spec/vcr/VAT/Seller_in_EU_country_Buyer_is_outside_EU/Seller_does_not_have_Nexus_Jurisdition_registered/tax_detail_country_equals_to_IT.yml

---
http_interactions:
- request:
    method: post
    uri: https://development.avalara.net/1.0/tax/get
    body:
      encoding: UTF-8
      string: '{"DocCode":"R794675732","DocDate":"2017-08-02","Discount":"0.0","Commit":false,"DocType":"SalesOrder","Addresses":[{"AddressCode":"Orig","Line1":"34
        Borgo degli Albizi","Line2":"","City":"Florence","Region":"","PostalCode":"50122","Country":"IT"},{"AddressCode":"Dest","Line1":"350
        Av Central","Line2":"","City":"Tamarindo","Region":"","Country":"CR","PostalCode":"50309"},{"AddressCode":"1","Line1":"34
        Borgo degli Albizi","Line2":null,"City":"Florence","PostalCode":"20500","Country":"IT"}],"Lines":[{"LineNo":"1-LI","Description":"Product
        #13 - 7993","TaxCode":"PC030000","ItemCode":"SKU-13","Qty":1,"Amount":19.99,"OriginCode":"1","DestinationCode":"Dest","CustomerUsageType":null,"Discounted":false,"TaxIncluded":true},{"LineNo":"2-FR","ItemCode":"Avalara
        Ground","Qty":1,"Amount":10.0,"OriginCode":"1","DestinationCode":"Dest","CustomerUsageType":null,"Description":"Shipping
        Charge","TaxCode":"FR000000","Discounted":false,"TaxIncluded":true}],"CustomerCode":1,"CompanyCode":"54321","CustomerUsageType":null,"ExemptionNo":null,"Client":"a0o33000004FH8l","ReferenceCode":"R794675732","DetailLevel":"Tax","CurrencyCode":"USD"}'
    headers:
      Accept:
      - "*/*; q=0.5, application/xml"
      Accept-Encoding:
      - gzip, deflate
      Authorization:
      - Basic MTEwMDExMzA5NjoxRDEzRURBMkRDQ0M3RTRB
      Content-Type:
      - application/json
      Content-Length:
      - '1131'
      User-Agent:
      - Ruby
  response:
    status:
      code: 200
      message: OK
    headers:
      Cache-Control:
      - private
      Content-Type:
      - text/json; charset=utf-8
      Content-Encoding:
      - gzip
      Vary:
      - Accept-Encoding
      X-Aspnet-Version:
      - 4.0.30319
      X-Powered-By:
      - ASP.NET
      Date:
      - Wed, 02 Aug 2017 23:36:13 GMT
      Content-Length:
      - '666'
      Set-Cookie:
      - TS017f1821=01a8ddc44e274285c4b279676df56a55025cfa7638c4c3c2175dff607848e949899bf5669831584a60c79c2f301bbc45437304d9a6;
        Path=/
    body:
      encoding: ASCII-8BIT
      string: !binary |-
        H4sIAAAAAAAEAO29B2AcSZYlJi9tynt/SvVK1+B0oQiAYBMk2JBAEOzBiM3m
        kuwdaUcjKasqgcplVmVdZhZAzO2dvPfee++999577733ujudTif33/8/XGZk
        AWz2zkrayZ4hgKrIHz9+fB8/In5x8tHTanpSzfKPHqUfvXrwcP/TB/cf3Nv7
        aMRfPM1a/mJvZ/fB9s7B9g5/8aZY5E2bLVbhV2/27j269+mj3f3x3s7e/sP9
        hz/Fjas2K48X1XrZcvOH44cP7edPi2Zqvtmxn56+yxertqiW4cdvsnfZpBR8
        Aij0BT4MWp5k5XRdEvoz91X2bmA82bvnxTJv6JvvJUQR/PGior8+2t1+fqYt
        DI1enuzc26FHP84mRVm01/imrdc5Pn1CI5pl9fXz/DIv8cVPFav7+IKbywB2
        zQBeKUY7Y4JJDz6jdvwRfu9TiFDpjy1CMhpt3mZFaYdFn7x396/yCwV69gZ/
        nwCXmocrH3xnXRfNm+sVQzHfms9fZAv+/OzN8fPfx35qKCkAqDfT7KfyukoZ
        o1+SfD/5JcmIkHZzsbf97JW+YCA8e0Uo06Mfv89c9AkWo7SlF3/AqNFfQ8Si
        3yNTQ592JsKQiVoIDbpUZjINEdUMXpoS9PdDkmEYituJoRbms+4sfD+R749n
        szpvGicm+gH9+dG9+zvp8WV6khOmWQmA+qVB9ikpDHx8ovPzJltkdbGcVfyh
        jpA+P+EpflmReinNu/dJ4JhZCQmh1BlTd2/n/u7ePXzBYzLNCYSwjqKAz+7t
        p0+q+qJKZ/lFWaTH5aT4QYE3tY15dxefGRyflVWdL6fMRx6KQvcQRULFUrqD
        4s5D/iJAkUAoXV/lzbpszeev19MpYfPRL0n+HyrvhRSYBQAA
    http_version: 
  recorded_at: Wed, 02 Aug 2017 23:36:14 GMT
- request:
    method: post
    uri: https://development.avalara.net/1.0/tax/get
    body:
      encoding: UTF-8
      string: '{"DocCode":"R794675732","DocDate":"2017-08-02","Discount":"0.0","Commit":false,"DocType":"SalesOrder","Addresses":[{"AddressCode":"Orig","Line1":"34
        Borgo degli Albizi","Line2":"","City":"Florence","Region":"","PostalCode":"50122","Country":"IT"},{"AddressCode":"Dest","Line1":"350
        Av Central","Line2":"","City":"Tamarindo","Region":"","Country":"CR","PostalCode":"50309"},{"AddressCode":"1","Line1":"34
        Borgo degli Albizi","Line2":null,"City":"Florence","PostalCode":"20500","Country":"IT"}],"Lines":[{"LineNo":"1-LI","Description":"Product
        #13 - 7993","TaxCode":"PC030000","ItemCode":"SKU-13","Qty":1,"Amount":19.99,"OriginCode":"1","DestinationCode":"Dest","CustomerUsageType":null,"Discounted":false,"TaxIncluded":true},{"LineNo":"2-FR","ItemCode":"Avalara
        Ground","Qty":1,"Amount":10.0,"OriginCode":"1","DestinationCode":"Dest","CustomerUsageType":null,"Description":"Shipping
        Charge","TaxCode":"FR000000","Discounted":false,"TaxIncluded":true}],"CustomerCode":1,"CompanyCode":"54321","CustomerUsageType":null,"ExemptionNo":null,"Client":"a0o33000004FH8l","ReferenceCode":"R794675732","DetailLevel":"Tax","CurrencyCode":"USD"}'
    headers:
      Accept:
      - "*/*; q=0.5, application/xml"
      Accept-Encoding:
      - gzip, deflate
      Authorization:
      - Basic MTEwMDExMzA5NjoxRDEzRURBMkRDQ0M3RTRB
      Content-Type:
      - application/json
      Content-Length:
      - '1131'
      User-Agent:
      - Ruby
  response:
    status:
      code: 200
      message: OK
    headers:
      Cache-Control:
      - private
      Content-Type:
      - text/json; charset=utf-8
      Content-Encoding:
      - gzip
      Vary:
      - Accept-Encoding
      X-Aspnet-Version:
      - 4.0.30319
      X-Powered-By:
      - ASP.NET
      Date:
      - Wed, 02 Aug 2017 23:36:14 GMT
      Content-Length:
      - '665'
      Set-Cookie:
      - TS017f1821=01a8ddc44e6732d09770db37d117c53b2156e5d8363e1d0dd8b818536f63f746347690604cddf6aae3ab684863e1980570ab9e9097;
        Path=/
    body:
      encoding: ASCII-8BIT
      string: !binary |-
        H4sIAAAAAAAEAO29B2AcSZYlJi9tynt/SvVK1+B0oQiAYBMk2JBAEOzBiM3m
        kuwdaUcjKasqgcplVmVdZhZAzO2dvPfee++999577733ujudTif33/8/XGZk
        AWz2zkrayZ4hgKrIHz9+fB8/In5x8tHTanpSzfKPHqUfvXrwcP/TB/cf3Nv7
        aMRfPM1a/mJvZ/fB9s7B9g5/8aZY5E2bLVbhV2/27j269+mj3f3xg92dgwcH
        P8VtqzYrjxfVetly64fjhw/t50+LZmq+2bGfnr7LF6u2qJbhx2+yd9mkFHQC
        KPQFPgxanmTldF0S9jP3VfZuYDjZu+fFMm/om+8lRBD88aKivz7a3X5+pi0M
        iV6e7NzboUc/ziZFWbTX+Kat1zk+fUIjmmX19fP8Mi/xxU8Vq/v4gpvLAHbN
        AF4pRjtjgkkPPqN2/BF+71OIUOmPLUIyGm3eZkVph0WfvHf3r/ILBXr2Bn+f
        AJeahysffGddF82b6xVDMd+az19kC/787M3x89/HfmooKQCoN9Psp/K6Shmj
        X5J8P/klyYiQdnOxt/3slb5gIDx7RSjTox+/z1z0CRajtKUXf8Co0V9DxKLf
        I1NDn3YmwpCJWggNulRmMg0R1QxemhL090OSYRiK24mhFuaz7ix8P5Hvj2ez
        Om8aJyb6Af350b37O+nxZXqSE6ZZCYD6pUH2KekLfHyi8/MmW2R1sZxV/KGO
        kD4/4Sl+WZF2Kc2790ngmFkJCaHUGVN3b+f+7t49fMFjMs0JhLCOooDP7u2n
        T6r6okpn+UVZpMflpPhBgTe1jXl3F58ZHJ+VVZ0vp8xHHopC9xBFQsVSuoPi
        zkP+IkCRQChdX+XNumzN56/X0ylh89EvSf4fBowhoZcFAAA=
    http_version: 
  recorded_at: Wed, 02 Aug 2017 23:36:14 GMT
recorded_with: VCR 3.0.3
