spec/vcr/VAT/Seller_in_EU_country_Buyer_is_outside_EU/Seller_does_not_have_Nexus_Jurisdition_registered/total_tax_is_0_since_utah_is_not_in_jurisdiction.yml

---
http_interactions:
- request:
    method: post
    uri: https://development.avalara.net/1.0/tax/get
    body:
      encoding: UTF-8
      string: '{"DocCode":"R326675884","DocDate":"2017-08-02","Discount":"0.0","Commit":false,"DocType":"SalesOrder","Addresses":[{"AddressCode":"Orig","Line1":"34
        Borgo degli Albizi","Line2":"","City":"Florence","Region":"","PostalCode":"50122","Country":"IT"},{"AddressCode":"Dest","Line1":"350
        Av Central","Line2":"","City":"Tamarindo","Region":"","Country":"CR","PostalCode":"50309"},{"AddressCode":"1","Line1":"34
        Borgo degli Albizi","Line2":null,"City":"Florence","PostalCode":"20500","Country":"IT"}],"Lines":[{"LineNo":"1-LI","Description":"Product
        #15 - 6260","TaxCode":"PC030000","ItemCode":"SKU-15","Qty":1,"Amount":19.99,"OriginCode":"1","DestinationCode":"Dest","CustomerUsageType":null,"Discounted":false,"TaxIncluded":true},{"LineNo":"2-FR","ItemCode":"Avalara
        Ground","Qty":1,"Amount":10.0,"OriginCode":"1","DestinationCode":"Dest","CustomerUsageType":null,"Description":"Shipping
        Charge","TaxCode":"FR000000","Discounted":false,"TaxIncluded":true}],"CustomerCode":1,"CompanyCode":"54321","CustomerUsageType":null,"ExemptionNo":null,"Client":"a0o33000004FH8l","ReferenceCode":"R326675884","DetailLevel":"Tax","CurrencyCode":"USD"}'
    headers:
      Accept:
      - "*/*; q=0.5, application/xml"
      Accept-Encoding:
      - gzip, deflate
      Authorization:
      - Basic MTEwMDExMzA5NjoxRDEzRURBMkRDQ0M3RTRB
      Content-Type:
      - application/json
      Content-Length:
      - '1131'
      User-Agent:
      - Ruby
  response:
    status:
      code: 200
      message: OK
    headers:
      Cache-Control:
      - private
      Content-Type:
      - text/json; charset=utf-8
      Content-Encoding:
      - gzip
      Vary:
      - Accept-Encoding
      X-Aspnet-Version:
      - 4.0.30319
      X-Powered-By:
      - ASP.NET
      Date:
      - Wed, 02 Aug 2017 23:36:17 GMT
      Content-Length:
      - '637'
      Set-Cookie:
      - TS017f1821=01a8ddc44e5ce99203b44969d8ebaffac24fd30a655c1c3a0dfec2277d7649f75df7cd76fc05240f7db064bacd495b62e3d916cda5;
        Path=/
    body:
      encoding: ASCII-8BIT
      string: !binary |-
        H4sIAAAAAAAEAO29B2AcSZYlJi9tynt/SvVK1+B0oQiAYBMk2JBAEOzBiM3m
        kuwdaUcjKasqgcplVmVdZhZAzO2dvPfee++999577733ujudTif33/8/XGZk
        AWz2zkrayZ4hgKrIHz9+fB8/In5x8tGrvFmX7Uk1yz96lH70ej2d5k3z0Sj5
        6Gk1NZ++urf36acP7h8c7OsXT7OWv9jb2X2wvXOwvbOHL94Ui7xps8Uq/OrN
        3r1H9z59tPtgfLD78ODB/f2f4sZVm5XHi2q9bLn5w/HDh/bzp0UzNd/s2E9P
        3+WLVVtUy/DjN9m7bFIKPgEU+gIfBi1PsnK6Lgn9mfsqe/e8WOYNffC9hCiC
        P15U9NdHu9vPz7SFIcXLk517O/Tox9mkKIv2Gt+09TrHp08I8VlWXz/PL/MS
        X/xUsbqPL/ro94cJiDKUXTOUV4QsPtgZU7f04DNqxx/p7/FBPc3brCjtsE7Q
        U82onr1Bk1f5hSIjf39nXRfNm+sV92Zam8/N+KUpQX9vPBnMi2zBjc7eHD//
        ffAptTCf/VReVylD+SXJ95NfkowIaTcXe9vPXukLBpdnr6gbevTjn8W54A8Y
        NfpraID0+8/pRHB3NyHJMAzFbzML30/k++PZrCbN4MREP6A/P7p3fyc9vkxP
        csI0KwFQvzTIPiW9gI9PdH7eZIusLpazij/UEdLnJzzFLyvSIqV59z4JHDMY
        ISGUOmPq7u3c3927hy94TKY5gRDWURTw2b399ElVX1TpLL8oi/S4nBQ/KPCm
        tjHv7uIzg+Ozsqrz5ZT5yENR6B6iSKhYSndQ3HnIXwQoEghH14gq/SXJ/wPH
        oyZfmAUAAA==
    http_version: 
  recorded_at: Wed, 02 Aug 2017 23:36:18 GMT
- request:
    method: post
    uri: https://development.avalara.net/1.0/tax/get
    body:
      encoding: UTF-8
      string: '{"DocCode":"R326675884","DocDate":"2017-08-02","Discount":"0.0","Commit":false,"DocType":"SalesOrder","Addresses":[{"AddressCode":"Orig","Line1":"34
        Borgo degli Albizi","Line2":"","City":"Florence","Region":"","PostalCode":"50122","Country":"IT"},{"AddressCode":"Dest","Line1":"350
        Av Central","Line2":"","City":"Tamarindo","Region":"","Country":"CR","PostalCode":"50309"},{"AddressCode":"1","Line1":"34
        Borgo degli Albizi","Line2":null,"City":"Florence","PostalCode":"20500","Country":"IT"}],"Lines":[{"LineNo":"1-LI","Description":"Product
        #15 - 6260","TaxCode":"PC030000","ItemCode":"SKU-15","Qty":1,"Amount":19.99,"OriginCode":"1","DestinationCode":"Dest","CustomerUsageType":null,"Discounted":false,"TaxIncluded":true},{"LineNo":"2-FR","ItemCode":"Avalara
        Ground","Qty":1,"Amount":10.0,"OriginCode":"1","DestinationCode":"Dest","CustomerUsageType":null,"Description":"Shipping
        Charge","TaxCode":"FR000000","Discounted":false,"TaxIncluded":true}],"CustomerCode":1,"CompanyCode":"54321","CustomerUsageType":null,"ExemptionNo":null,"Client":"a0o33000004FH8l","ReferenceCode":"R326675884","DetailLevel":"Tax","CurrencyCode":"USD"}'
    headers:
      Accept:
      - "*/*; q=0.5, application/xml"
      Accept-Encoding:
      - gzip, deflate
      Authorization:
      - Basic MTEwMDExMzA5NjoxRDEzRURBMkRDQ0M3RTRB
      Content-Type:
      - application/json
      Content-Length:
      - '1131'
      User-Agent:
      - Ruby
  response:
    status:
      code: 200
      message: OK
    headers:
      Cache-Control:
      - private
      Content-Type:
      - text/json; charset=utf-8
      Content-Encoding:
      - gzip
      Vary:
      - Accept-Encoding
      X-Aspnet-Version:
      - 4.0.30319
      X-Powered-By:
      - ASP.NET
      Date:
      - Wed, 02 Aug 2017 23:36:18 GMT
      Content-Length:
      - '637'
      Set-Cookie:
      - TS017f1821=01a8ddc44e4f594476162ac5897941a00a97ee56adc222a0d633f7df42326fe070fd5c80253e4c82dfa861be48a4a9cee55802df4d;
        Path=/
    body:
      encoding: ASCII-8BIT
      string: !binary |-
        H4sIAAAAAAAEAO29B2AcSZYlJi9tynt/SvVK1+B0oQiAYBMk2JBAEOzBiM3m
        kuwdaUcjKasqgcplVmVdZhZAzO2dvPfee++999577733ujudTif33/8/XGZk
        AWz2zkrayZ4hgKrIHz9+fB8/In5x8tGrvFmX7Uk1yz96lH70ej2d5k3z0Sj5
        6Gk1NZ++urf36acP7h8c7OsXT7OWv9jb2X2wvXOwvbOHL94Ui7xps8Uq/OrN
        3r1H9z59tHsw3nuw+3Dn3r2f4sZVm5XHi2q9bLn5w/HDh/bzp0UzNd/s2E9P
        3+WLVVtUy/DjN9m7bFIKPgEU+gIfBi1PsnK6Lgn9mfsqe/e8WOYNffC9hCiC
        P15U9NdHu9vPz7SFIcXLk517O/Tox9mkKIv2Gt+09TrHp08I8VlWXz/PL/MS
        X/xUsbqPL/ro94cJiDKUXTOUV4QsPtgZU7f04DNqxx/p7/FBPc3brCjtsE7Q
        U82onr1Bk1f5hSIjf39nXRfNm+sV92Zam8/N+KUpQX9vPBnMi2zBjc7eHD//
        ffAptTCf/VReVylD+SXJ95NfkowIaTcXe9vPXukLBpdnr6gbevTjn8W54A8Y
        NfpraID0+8/pRHB3NyHJMAzFbzML30/k++PZrCbN4MREP6A/P7p3fyc9vkxP
        csI0KwFQvzTIPiW9gI9PdH7eZIusLpazij/UEdLnJzzFLyvSIqV59z4JHDMY
        ISGUOmPq7u3c3927hy94TKY5gRDWURTw2b399ElVX1TpLL8oi/S4nBQ/KPCm
        tjHv7uIzg+Ozsqrz5ZT5yENR6B6iSKhYSndQ3HnIXwQoEghH14gq/SXJ/wPH
        plTImAUAAA==
    http_version: 
  recorded_at: Wed, 02 Aug 2017 23:36:18 GMT
recorded_with: VCR 3.0.3
