spec/vcr/VAT/Seller_in_EU_country_Buyer_is_outside_EU/Seller_does_not_have_Nexus_Jurisdition_registered/with_BusinessIdentificationNo/origin_country_zero_rate_is_returned.yml

---
http_interactions:
- request:
    method: post
    uri: https://development.avalara.net/1.0/tax/get
    body:
      encoding: UTF-8
      string: '{"DocCode":"R703200174","DocDate":"2017-08-02","Discount":"0.0","Commit":false,"DocType":"SalesOrder","Addresses":[{"AddressCode":"Orig","Line1":"34
        Borgo degli Albizi","Line2":"","City":"Florence","Region":"","PostalCode":"50122","Country":"IT"},{"AddressCode":"Dest","Line1":"350
        Av Central","Line2":"","City":"Tamarindo","Region":"","Country":"CR","PostalCode":"50309"},{"AddressCode":"1","Line1":"34
        Borgo degli Albizi","Line2":null,"City":"Florence","PostalCode":"20500","Country":"IT"}],"Lines":[{"LineNo":"1-LI","Description":"Product
        #16 - 8406","TaxCode":"PC030000","ItemCode":"SKU-16","Qty":1,"Amount":19.99,"OriginCode":"1","DestinationCode":"Dest","CustomerUsageType":null,"Discounted":false,"TaxIncluded":true},{"LineNo":"2-FR","ItemCode":"Avalara
        Ground","Qty":1,"Amount":10.0,"OriginCode":"1","DestinationCode":"Dest","CustomerUsageType":null,"Description":"Shipping
        Charge","TaxCode":"FR000000","Discounted":false,"TaxIncluded":true}],"CustomerCode":1,"CompanyCode":"54321","CustomerUsageType":null,"ExemptionNo":null,"Client":"a0o33000004FH8l","ReferenceCode":"R703200174","DetailLevel":"Tax","CurrencyCode":"USD"}'
    headers:
      Accept:
      - "*/*; q=0.5, application/xml"
      Accept-Encoding:
      - gzip, deflate
      Authorization:
      - Basic MTEwMDExMzA5NjoxRDEzRURBMkRDQ0M3RTRB
      Content-Type:
      - application/json
      Content-Length:
      - '1131'
      User-Agent:
      - Ruby
  response:
    status:
      code: 200
      message: OK
    headers:
      Cache-Control:
      - private
      Content-Type:
      - text/json; charset=utf-8
      Content-Encoding:
      - gzip
      Vary:
      - Accept-Encoding
      X-Aspnet-Version:
      - 4.0.30319
      X-Powered-By:
      - ASP.NET
      Date:
      - Wed, 02 Aug 2017 23:36:19 GMT
      Content-Length:
      - '636'
      Set-Cookie:
      - TS017f1821=01a8ddc44ee0669fea53cb0df6cb380a76836ba6c213052eb29b39e5f9845c7a66b41e0ed4f5c27ec4d0f825998e19fed825302c73;
        Path=/
    body:
      encoding: ASCII-8BIT
      string: !binary |-
        H4sIAAAAAAAEAO29B2AcSZYlJi9tynt/SvVK1+B0oQiAYBMk2JBAEOzBiM3m
        kuwdaUcjKasqgcplVmVdZhZAzO2dvPfee++999577733ujudTif33/8/XGZk
        AWz2zkrayZ4hgKrIHz9+fB8/In5x8tGrvFmX7Uk1yz96lH70ej2d5k3z0Sj5
        6Gk1NZ++erBzb29nZ/fBvn7xNGv5iz36bHvnYHtnD1+8KRZ502aLVfjVm717
        j+59+mj34Xj//oMHOzsHP8WNqzYrjxfVetly84fjhw/t50+LZmq+2bGfnr7L
        F6u2qJbhx2+yd9mkFHwCKPQFPgxanmTldF0S+jP3VfbuebHMG/rgewlRBH+8
        qOivj3a3n59pC0OKlyc793bo0Y+zSVEW7TW+aet1jk+fEOKzrL5+nl/mJb74
        qWJ1H1/00e8PExBlKEQuGcorQhYf7IypW3rwGbXjj/T3+KCe5m1WlHZYJ+ip
        ZlTP3qDJq/xCkZG/v7Oui+bN9Yp7M63N52b80pSgvzeeDOZFtuBGZ2+On/8+
        +JRamM9+Kq+rlKH8kuT7yS9JRoS0m4u97Wev9AWDy7NX1A09+vHP4lzwB4wa
        /TU0QPr953QiuLubkGQYhuK3mYXvJ/L98WxWk2ZwYqIf0J8f3bu/kx5fpic5
        YZqVAKhfGmSfkl7Axyc6P2+yRVYXy1nFH+oI6fMTnuKXFWmR0rx7nwSOGYyQ
        EEqdMXX3du7v7t3DFzwm05xACOsoCvjs3n76pKovqnSWX5RFelxOih8UeFPb
        mHd38ZnB8VlZ1flyynzkoSh0D1EkVCylOyjuPOQvAhQJhKNrRJX+kuT/AXuh
        lUqYBQAA
    http_version: 
  recorded_at: Wed, 02 Aug 2017 23:36:19 GMT
- request:
    method: post
    uri: https://development.avalara.net/1.0/tax/get
    body:
      encoding: UTF-8
      string: '{"DocCode":"R703200174","DocDate":"2017-08-02","Discount":"0.0","Commit":false,"DocType":"SalesOrder","Addresses":[{"AddressCode":"Orig","Line1":"34
        Borgo degli Albizi","Line2":"","City":"Florence","Region":"","PostalCode":"50122","Country":"IT"},{"AddressCode":"Dest","Line1":"350
        Av Central","Line2":"","City":"Tamarindo","Region":"","Country":"CR","PostalCode":"50309"},{"AddressCode":"1","Line1":"34
        Borgo degli Albizi","Line2":null,"City":"Florence","PostalCode":"20500","Country":"IT"}],"Lines":[{"LineNo":"1-LI","Description":"Product
        #16 - 8406","TaxCode":"PC030000","ItemCode":"SKU-16","Qty":1,"Amount":19.99,"OriginCode":"1","DestinationCode":"Dest","CustomerUsageType":null,"Discounted":false,"TaxIncluded":true},{"LineNo":"2-FR","ItemCode":"Avalara
        Ground","Qty":1,"Amount":10.0,"OriginCode":"1","DestinationCode":"Dest","CustomerUsageType":null,"Description":"Shipping
        Charge","TaxCode":"FR000000","Discounted":false,"TaxIncluded":true}],"CustomerCode":1,"CompanyCode":"54321","CustomerUsageType":null,"ExemptionNo":null,"Client":"a0o33000004FH8l","ReferenceCode":"R703200174","DetailLevel":"Tax","CurrencyCode":"USD","BusinessIdentificationNo":"123456789"}'
    headers:
      Accept:
      - "*/*; q=0.5, application/xml"
      Accept-Encoding:
      - gzip, deflate
      Authorization:
      - Basic MTEwMDExMzA5NjoxRDEzRURBMkRDQ0M3RTRB
      Content-Type:
      - application/json
      Content-Length:
      - '1170'
      User-Agent:
      - Ruby
  response:
    status:
      code: 200
      message: OK
    headers:
      Cache-Control:
      - private
      Content-Type:
      - text/json; charset=utf-8
      Content-Encoding:
      - gzip
      Vary:
      - Accept-Encoding
      X-Aspnet-Version:
      - 4.0.30319
      X-Powered-By:
      - ASP.NET
      Date:
      - Wed, 02 Aug 2017 23:36:19 GMT
      Content-Length:
      - '634'
      Set-Cookie:
      - TS017f1821=01a8ddc44efa7785428ef3acbf3d3ce88aa5a6cecad02a6f8fe8a5b9b9a596b5174630474b5185f5f755b9f124f9c5436d1ab0a6c5;
        Path=/
    body:
      encoding: ASCII-8BIT
      string: !binary |-
        H4sIAAAAAAAEAO29B2AcSZYlJi9tynt/SvVK1+B0oQiAYBMk2JBAEOzBiM3m
        kuwdaUcjKasqgcplVmVdZhZAzO2dvPfee++999577733ujudTif33/8/XGZk
        AWz2zkrayZ4hgKrIHz9+fB8/In5x8tGrvFmX7Uk1yz96lH70ej2d5k3z0Sj5
        6Gk1NZ++erBzb29nZ/fBvn7xNGv5iz36bHvnYHtnD1+8KRZ502aLVfjVm717
        j+59+mj34fjh7s7DhwcPfoobV21WHi+q9bLl5vTtQ/v506KZmm927Ken7/LF
        qi2qZfjxm+xdNikFnwAKfYEPg5YnWTldl4T+zH2VvXteLPOGPvheQhTBHy8q
        +uuj3e3nZ9rCkOLlyc69HXr042xSlEV7jW/aep3j0yeE+Cyrr5/nl3mJL36q
        WN3HF330+8MERBkKyMVDeUXI4oOdMXVLDz6jdvyR/h4f1NO8zYrSDusEPdWM
        6tkbNHmVXygy8vd31nXRvLlecW+mtfncjF+aEvT3xpPBvMgW3OjszfHz3wef
        Ugvz2U/ldZUylF+SfD/5JcmIkHZzsbf97JW+YHB59oq6oUc//lmcC/6AUaO/
        hgZIv/+cTgR3dxOSDMNQ/Daz8P1Evj+ezWrSDE5M9AP686N793fS48v0JCdM
        sxIA9UuD7FPSC/j4ROfnTbbI6mI5q/hDHSF9fsJT/LIiLVKad++TwDGDERJC
        qTOm7t7O/d29e/iCx2SaEwhhHUUBn93bT59U9UWVzvKLskiPy0nxgwJvahvz
        7i4+Mzg+K6s6X06ZjzwUhe4hioSKpXQHxZ2H/EWAIoFwdI2o0l+S/D9DDoWq
        mAUAAA==
    http_version: 
  recorded_at: Wed, 02 Aug 2017 23:36:20 GMT
recorded_with: VCR 3.0.3
